In [3]:
import pandas as pd
pd.__version__

'2.3.3'

### Import Employees CSV

In [4]:
df = pd.read_csv("employees.csv")
df.head()

   employee_id    name   department  salary  years_at_company  age
0            1   Frank  Engineering   95000                 3   28
1            2   Sarah    Marketing   72000                 2   26
2            3   Jason        Sales   68000                 4   31
3            4  Amanda  Engineering  105000                 6   34
4            5    Luke           HR   58000                 1   24

### Pandas Warm-Ups

#### Warm-Up 1 — Create a simple DataFrame manually

In [30]:
user = {
    "name": "Frank",
    "role": "AI Engineer",
    "active": True,
    "skills": ["Python", "LLMs", "Automation"]
}

df = pd.DataFrame(user)
df.head()

    name         role  active      skills
0  Frank  AI Engineer    True      Python
1  Frank  AI Engineer    True        LLMs
2  Frank  AI Engineer    True  Automation

#### Warm-Up 2 — Explore my employees CSV

In [32]:
df = pd.read_csv("employees.csv")

In [33]:
df.head()

   employee_id    name   department  salary  years_at_company  age
0            1   Frank  Engineering   95000                 3   28
1            2   Sarah    Marketing   72000                 2   26
2            3   Jason        Sales   68000                 4   31
3            4  Amanda  Engineering  105000                 6   34
4            5    Luke           HR   58000                 1   24

In [36]:
df.tail()

   employee_id    name   department  salary  years_at_company  age
5            6   Emily      Finance   83000                 5   30
6            7   Kevin  Engineering   99000                 4   29
7            8  Olivia        Sales   64000                 2   25
8            9  Daniel      Finance   90000                 7   36
9           10  Sophia    Marketing   76000                 3   27

In [46]:
df.sample(3)

   employee_id   name   department  salary  years_at_company  age
6            7  Kevin  Engineering   99000                 4   29
0            1  Frank  Engineering   95000                 3   28
1            2  Sarah    Marketing   72000                 2   26

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       10 non-null     int64
 1   name              10 non-null     object
 2   department        10 non-null     object
 3   salary            10 non-null     int64
 4   years_at_company  10 non-null     int64
 5   age               10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 612.0+ bytes

In [48]:
df.describe()

       employee_id         salary  years_at_company        age
count     10.00000      10.000000         10.000000  10.000000
mean       5.50000   81000.000000          3.700000  29.000000
std        3.02765   15895.492023          1.888562   3.858612
min        1.00000   58000.000000          1.000000  24.000000
25%        3.25000   69000.000000          2.250000  26.250000
50%        5.50000   79500.000000          3.500000  28.500000
75%        7.75000   93750.000000          4.750000  30.750000
max       10.00000  105000.000000          7.000000  36.000000

### Warm-Up 3 — Select Columns

#### Select one column, then select two

In [66]:
df[['name']]

     name
0   Frank
1   Sarah
2   Jason
3  Amanda
4    Luke
5   Emily
6   Kevin
7  Olivia
8  Daniel
9  Sophia

In [65]:
df[['name','age']]

     name  age
0   Frank   28
1   Sarah   26
2   Jason   31
3  Amanda   34
4    Luke   24
5   Emily   30
6   Kevin   29
7  Olivia   25
8  Daniel   36
9  Sophia   27

### Warm-Up 4 — Filter Rows

##### Filter for those that are age 30+

In [73]:
thirty_and_over = df[df["age"] >= 30]
thirty_and_over

   employee_id    name   department  salary  years_at_company  age
2            3   Jason        Sales   68000                 4   31
3            4  Amanda  Engineering  105000                 6   34
5            6   Emily      Finance   83000                 5   30
8            9  Daniel      Finance   90000                 7   36

#### Filter for those that make at least $75,000 per year

In [76]:
minimum_salary_of_75k = df[df["salary"] >= 75000]
minimum_salary_of_75k

   employee_id    name   department  salary  years_at_company  age
0            1   Frank  Engineering   95000                 3   28
3            4  Amanda  Engineering  105000                 6   34
5            6   Emily      Finance   83000                 5   30
6            7   Kevin  Engineering   99000                 4   29
8            9  Daniel      Finance   90000                 7   36
9           10  Sophia    Marketing   76000                 3   27

### Warm-Up 5 — Sorting and Resetting Index

#### Sort by salary

In [108]:
df_by_salary = df.sort_values(by="salary")
df_by_salary

   employee_id    name   department  salary  years_at_company  age
4            5    Luke           HR   58000                 1   24
7            8  Olivia        Sales   64000                 2   25
2            3   Jason        Sales   68000                 4   31
1            2   Sarah    Marketing   72000                 2   26
9           10  Sophia    Marketing   76000                 3   27
5            6   Emily      Finance   83000                 5   30
8            9  Daniel      Finance   90000                 7   36
0            1   Frank  Engineering   95000                 3   28
6            7   Kevin  Engineering   99000                 4   29
3            4  Amanda  Engineering  105000                 6   34

#### Sort by age

In [110]:
df_by_age = df.sort_values(by="age")
df_by_age

   employee_id    name   department  salary  years_at_company  age
4            5    Luke           HR   58000                 1   24
7            8  Olivia        Sales   64000                 2   25
1            2   Sarah    Marketing   72000                 2   26
9           10  Sophia    Marketing   76000                 3   27
0            1   Frank  Engineering   95000                 3   28
6            7   Kevin  Engineering   99000                 4   29
5            6   Emily      Finance   83000                 5   30
2            3   Jason        Sales   68000                 4   31
3            4  Amanda  Engineering  105000                 6   34
8            9  Daniel      Finance   90000                 7   36

#### Reset index of the age sorted data set

In [112]:
df_by_age = df_by_age.reset_index(drop=True)
df_by_age

   employee_id    name   department  salary  years_at_company  age
0            5    Luke           HR   58000                 1   24
1            8  Olivia        Sales   64000                 2   25
2            2   Sarah    Marketing   72000                 2   26
3           10  Sophia    Marketing   76000                 3   27
4            1   Frank  Engineering   95000                 3   28
5            7   Kevin  Engineering   99000                 4   29
6            6   Emily      Finance   83000                 5   30
7            3   Jason        Sales   68000                 4   31
8            4  Amanda  Engineering  105000                 6   34
9            9  Daniel      Finance   90000                 7   36

## Mini Project — Employee Dataset EDA

### Task 1 - Basic Structure Checks
##### Using my df:
##### 1. What are the column names?
##### 2. What are the data types?
##### 3. How many rows and columns?
##### 4. Are there any missing values?

In [125]:
df.columns

Index(['employee_id', 'name', 'department', 'salary', 'years_at_company',
       'age'],
      dtype='object')

In [126]:
df.dtypes

employee_id          int64
name                object
department          object
salary               int64
years_at_company     int64
age                  int64
dtype: object

In [127]:
df.shape

(10, 6)

In [131]:
df.isnull().sum()

employee_id         0
name                0
department          0
salary              0
years_at_company    0
age                 0
dtype: int64

### Task 2 - Summary Statistics
##### Using my df:
##### 1. What is the average salary?
##### 2. What is the average years at the company?
##### 3. What is the median age?
##### 4. What is the maximum and minimum salary?

In [142]:
df['salary'].mean()

np.float64(81000.0)

In [143]:
df['years_at_company'].mean()

np.float64(3.7)

In [144]:
df['age'].median()

np.float64(28.5)

In [150]:
df['salary'].agg(['min','max'])

min     58000
max    105000
Name: salary, dtype: int64

### Task 3 - Filtering & Insights
##### Create and display:
##### 1. All employees in engineering
##### 2. All employees with salary > 80,000
#####  3. All employees with years_at_company ≥ 3
#####  4. All employees in Marketing under age 28

In [176]:
df.loc[df['department'] == 'Engineering', ['name']]

     name
0   Frank
3  Amanda
6   Kevin

In [177]:
df.loc[df['salary'] > 80000, ['name']]

     name
0   Frank
3  Amanda
5   Emily
6   Kevin
8  Daniel

In [178]:
df.loc[df['years_at_company'] >= 3, ['name']]

     name
0   Frank
2   Jason
3  Amanda
5   Emily
6   Kevin
8  Daniel
9  Sophia

In [179]:
df.loc[(df['department'] == 'Marketing') & (df['age'] < 28)]

   employee_id    name department  salary  years_at_company  age
1            2   Sarah  Marketing   72000                 2   26
9           10  Sophia  Marketing   76000                 3   27

### Task 4 - Sorting
##### Sort the DataFrame by:
##### A. Salary (Descending)
##### B. Age (Ascending)

In [203]:
df.sort_values(by='salary',ascending=False).reset_index(drop=True)

   employee_id    name   department  salary  years_at_company  age
0            4  Amanda  Engineering  105000                 6   34
1            7   Kevin  Engineering   99000                 4   29
2            1   Frank  Engineering   95000                 3   28
3            9  Daniel      Finance   90000                 7   36
4            6   Emily      Finance   83000                 5   30
5           10  Sophia    Marketing   76000                 3   27
6            2   Sarah    Marketing   72000                 2   26
7            3   Jason        Sales   68000                 4   31
8            8  Olivia        Sales   64000                 2   25
9            5    Luke           HR   58000                 1   24

In [204]:
df.sort_values(by='age').reset_index(drop=True)

   employee_id    name   department  salary  years_at_company  age
0            5    Luke           HR   58000                 1   24
1            8  Olivia        Sales   64000                 2   25
2            2   Sarah    Marketing   72000                 2   26
3           10  Sophia    Marketing   76000                 3   27
4            1   Frank  Engineering   95000                 3   28
5            7   Kevin  Engineering   99000                 4   29
6            6   Emily      Finance   83000                 5   30
7            3   Jason        Sales   68000                 4   31
8            4  Amanda  Engineering  105000                 6   34
9            9  Daniel      Finance   90000                 7   36

### Task 5 - Create a new column
#### Call it "salary_level", with thresholds

In [227]:
import numpy as np

conditions = [
    (df['salary'] < 70000),
    (df['salary'] >= 70000) & (df['salary'] <= 90000),
    (df['salary'] > 90000)
]

choices = [
    "Low",
    "Medium",
    "High"
    ]

df['salary_level'] = np.select(conditions,choices,default='other')
df

,employee_id,name,department,salary,years_at_company,age,salary_level
0,1,Frank,Engineering,95000,3,28,High
1,2,Sarah,Marketing,72000,2,26,Medium
2,3,Jason,Sales,68000,4,31,Low
3,4,Amanda,Engineering,105000,6,34,High
4,5,Luke,HR,58000,1,24,Low
5,6,Emily,Finance,83000,5,30,Medium
6,7,Kevin,Engineering,99000,4,29,High
7,8,Olivia,Sales,64000,2,25,Low
8,9,Daniel,Finance,90000,7,36,Medium
9,10,Sophia,Marketing,76000,3,27,Medium

### Task 6 - Top 3 Salary Earners

In [24]:
df.loc[df['salary'].nlargest(3).index]

   employee_id    name   department  salary  years_at_company  age
3            4  Amanda  Engineering  105000                 6   34
6            7   Kevin  Engineering   99000                 4   29
0            1   Frank  Engineering   95000                 3   28